app/controllers/messages_controller.rb

INSERT INTO "messages" ("body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "This is a new test message"], ["user_id", 1], ["created_at", "2019-11-01 17:56:24.187872"], ["updated_at", "2019-11-01 17:56:24.187872"]]
---
  def create
    message = current_user.messages.build(message_params)
    if message.save